app/Controllers/Home.php

SELECT *
FROM `clientes`
---
    public function listarDados(){
        $clientesModel = new ClientesModel();
        $dados['clientes'] = $clientesModel->findAll();

DELETE FROM `clientes`
WHERE `id` IN ('4')
---
    public function excluir($id){
        $clientesModel = new ClientesModel();
        $clientesModel->delete($id);

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '4'
---
    public function editar($id){
        $clientesModel = new ClientesModel();
        $dados['cliente'] = $clientesModel->find($id);